### Pandas
Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.
The name "Pandas" has a reference to "Python Data Analysis"
Main Purpose(USE) of using Pandas Library:
Pandas allows us to analyze data and make conclusions based on statistical theories observed in from data.
Pandas can clean messy data sets, and make them readable and relevant for future use.
Relevant data is very important in data science.

In [1]:
import pandas as pd

In [2]:
pd?

In [3]:
pd.__version__

'1.0.1'

In [4]:
!pip show pandas

Name: pandas
Version: 1.0.1
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author:
Author-email:
License: BSD
Location: c:\dell\lib\site-packages
Requires: numpy, python-dateutil, pytz
Required-by: seaborn, statsmodels

### Series
A Series in Datastructure of Pandas which is like a column in a table.It is a one-dimensional array holding data of any type.

In [15]:
s = pd.Series(['A','B','C','D'])

In [16]:
s

0    A
1    B
2    C
3    D
dtype: object

In [18]:
len(s)

4

### Labels
If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.This labels can be used to access a specified value.With the index argument, you can name your own labels.

In [19]:
s = pd.Series(['A','B','C','D'],index=list(range(101,105)))

In [20]:
s

101    A
102    B
103    C
104    D
dtype: object

In [21]:
print(s[101])
print()

print(s[102])

s[106]='F'
print(s)

s[104]='d'
print(s)

A

B
101    A
102    B
103    C
104    D
106    F
dtype: object
101    A
102    B
103    C
104    d
106    F
dtype: object

In [22]:
# Creating series from array

import numpy as np
data = np.array(['a','b','c','d',1,5])
s = pd.Series(data)
print(s)

print(s[0])

0    a
1    b
2    c
3    d
4    1
5    5
dtype: object
a

In [23]:
data=np.array(["India","UK","USA","Japan","SriLanka"])
s=pd.Series(data,index=[101,102,103,104,105])
print(s)
print(s[103])
s[104]=100
s[102]=120
print(s)

101       India
102          UK
103         USA
104       Japan
105    SriLanka
dtype: object
USA
101       India
102         120
103         USA
104         100
105    SriLanka
dtype: object

In [24]:
country = ["India","UK","USA","Japan","SriLanka"]
sales = [10000,4300,2000,80000,2000]

In [25]:
S1 = pd.Series(sales,index=country)
S1

India       10000
UK           4300
USA          2000
Japan       80000
SriLanka     2000
dtype: int64

In [26]:
print(S1['UK'])

S1['India']=50000
print(S1)

4300
India       50000
UK           4300
USA          2000
Japan       80000
SriLanka     2000
dtype: int64

In [27]:
S1[3]

80000

### Creating a Series from dict
A dict can be passed as input and if no index is specified, then the dictionary keys are taken in a sorted order to construct index. If index is passed, the values in data corresponding to the labels in the index will be pulled out.

In [28]:
data={'a':0,'b':2,'c':3.2}
s1=pd.Series(data)
print(s1)

a    0.0
b    2.0
c    3.2
dtype: float64

In [29]:
print(s1['b'])
print(s1[1])
print()
print(s1[:-1])
s1[1]=10
print(s1)

2.0
2.0

a    0.0
b    2.0
dtype: float64
a     0.0
b    10.0
c     3.2
dtype: float64

In [30]:
data = {'a' : 0., 'b' : 1., 'e' : 2.}
s = pd.Series(data,index=['x','t','e','f','z','y'])
print(s)

x    NaN
t    NaN
e    2.0
f    NaN
z    NaN
y    NaN
dtype: float64

### Creating a Series from Scalar
If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [31]:
data = pd.Series(7, index=['a','b','c','d'])
print(data)

a    7
b    7
c    7
d    7
dtype: int64

### DataFrames
Data sets in Pandas are usually two-dimensional tables, called DataFrames.It is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.Series is just a column but DataFrame is a whole table.

In [35]:
Customers = {
    'Id':[101,102,103],
    'Name':['Roy','Clara','Ross'],
    'Location':['Goa','Bangalore','Pune']

}

In [36]:
cust_data = pd.DataFrame(Customers)

In [44]:
cust_data

    Id   Name   Location
0  101    Roy        Goa
1  102  Clara  Bangalore
2  103   Ross       Pune

In [38]:
cust_data1 = pd.DataFrame(Customers,index=['a','b','c'])
cust_data1

    Id   Name   Location
a  101    Roy        Goa
b  102  Clara  Bangalore
c  103   Ross       Pune

In [39]:
my_dict = {'Name':"Nimisha",'Age':23,'City':"Mumbai"}

In [41]:
cust_data = pd.DataFrame(Customers)

In [43]:
table1 = pd.DataFrame(my_dict,index=['a'])

In [45]:
table1

      Name  Age    City
a  Nimisha   23  Mumbai

In [47]:
my_dict = {'Name':["Nimisha"],'Age':[23],'City':["Mumbai"]}

In [48]:
table2 = pd.DataFrame(my_dict)
table2

      Name  Age    City
0  Nimisha   23  Mumbai

### Creating an empty dataframe

In [49]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [51]:
Column_data = ['Id','Student','Subject','Marks']

In [52]:
df = pd.DataFrame(columns=Column_data)
df

Empty DataFrame
Columns: [Id, Student, Subject, Marks]
Index: []

In [53]:
df=df.append({'Id':1,'Student':'Sam',"Subject":'Science','Marks':50},ignore_index=True)
df

  Id Student  Subject Marks
0  1     Sam  Science    50

In [55]:
stud_df = pd.DataFrame(columns=Column_data)
stud_df

Empty DataFrame
Columns: [Id, Student, Subject, Marks]
Index: []

In [56]:
stud_df['Id']=[2,3,4]
stud_df['Student']=['Nishita','Chinmay','Gaurav']
stud_df['Subject']=['Maths','Economics','History']
stud_df['Marks']=[34,67,70]
stud_df

   Id  Student    Subject  Marks
0   2  Nishita      Maths     34
1   3  Chinmay  Economics     67
2   4   Gaurav    History     70

In [57]:
data=[['Amit',35],['Riya',24],['Clara',40]]
df=pd.DataFrame(data,columns=['Name','Age'])
#print(df)

#renaming the columns
df.columns=["First_name","Age"]
df

  First_name  Age
0       Amit   35
1       Riya   24
2      Clara   40

In [58]:
data={'Name':['Amit','Nimisha','Priya'],'Age':[20,24,21]}
df=pd.DataFrame(data)
df

df=pd.DataFrame(data,index=['rank1','rank2','rank3'])
df

          Name  Age
rank1     Amit   20
rank2  Nimisha   24
rank3    Priya   21

In [59]:
data={'Name':['Amit','Nimisha','Priya'],'Age':[20,24,21]}
df=pd.DataFrame(data)
df

df=pd.DataFrame(data,index=['rank1','rank2','rank3'])
df

          Name  Age
rank1     Amit   20
rank2  Nimisha   24
rank3    Priya   21

In [60]:
#rowlabels will be added on the top of the index numbers
df=pd.DataFrame(data,index=list(range(101,104)))
#row indexes will replace the original index numbers
df

        Name  Age
101     Amit   20
102  Nimisha   24
103    Priya   21

In [68]:
#adding a column
df["address"]=["Mumbai","Pune","Mumbai"]
df

        Name  Age address
101     Amit   20  Mumbai
102  Nimisha   24    Pune
103    Priya   21  Mumbai

In [69]:
#rearranging the column order
df=df[['Name','address','Age']]
df

        Name address  Age
101     Amit  Mumbai   20
102  Nimisha    Pune   24
103    Priya  Mumbai   21

In [70]:
df.columns

Index(['Name', 'address', 'Age'], dtype='object')

In [71]:
df['Newcol']=[6,12,30]
print(df)

df["Revised_col"]=df["Newcol"]*2
print(df)

C:\dell\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

        Name address  Age  Newcol
101     Amit  Mumbai   20       6
102  Nimisha    Pune   24      12
103    Priya  Mumbai   21      30
        Name address  Age  Newcol  Revised_col
101     Amit  Mumbai   20       6           12
102  Nimisha    Pune   24      12           24
103    Priya  Mumbai   21      30           60

C:\dell\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [72]:
#deleting the column
del df["Newcol"]
df

        Name address  Age  Revised_col
101     Amit  Mumbai   20           12
102  Nimisha    Pune   24           24
103    Priya  Mumbai   21           60

In [74]:
#ideally used for deleting the data

#df.drop(101)
#df.drop(['Revised_col'],axis=1)
#df.drop(101,inplace=True)

In [75]:
df

        Name address  Age  Revised_col
102  Nimisha    Pune   24           24
103    Priya  Mumbai   21           60

In [76]:
import os
os.getcwd()

'C:\\Users\\dell'

In [81]:
df.to_csv(r'C:\\Users\\dell\\sample.csv',index=True,header=True)

In [82]:
df.to_excel("sample.xlsx",index=False,header=True)

In [83]:
#creating a copy of a dataframe
new_df=pd.DataFrame.copy(df)

In [84]:
new_df

        Name address  Age  Revised_col
102  Nimisha    Pune   24           24
103    Priya  Mumbai   21           60

In [88]:
df=pd.read_csv(r'C:\\Users\\dell\\sample.csv',index_col=0,header=0)

In [89]:
df

        Name address  Age  Revised_col
102  Nimisha    Pune   24           24
103    Priya  Mumbai   21           60

In [90]:
df3=pd.read_excel('sample.xlsx',header=0)
df3

      Name address  Age  Revised_col
0  Nimisha    Pune   24           24
1    Priya  Mumbai   21           60

In [91]:
df.at["rank1",["Name","address"]]=["Riya","Mumbai"]

In [92]:
df

          Name address   Age  Revised_col
102    Nimisha    Pune  24.0         24.0
103      Priya  Mumbai  21.0         60.0
rank1     Riya  Mumbai   NaN          NaN

In [93]:
df.loc[(df.Name=="Priya") & (df.address=="Mumbai"),
       ["address","Age"]]=["Delhi",np.nan]
df

          Name address   Age  Revised_col
102    Nimisha    Pune  24.0         24.0
103      Priya   Delhi   NaN         60.0
rank1     Riya  Mumbai   NaN          NaN

In [94]:
#sorting on the basis of certain criteria

df=df.sort_values(["address"],ascending=False)
print(df)
#True, False

df=df.sort_values(["address","Name"],ascending=[False,True])
df

          Name address   Age  Revised_col
102    Nimisha    Pune  24.0         24.0
rank1     Riya  Mumbai   NaN          NaN
103      Priya   Delhi   NaN         60.0

          Name address   Age  Revised_col
102    Nimisha    Pune  24.0         24.0
rank1     Riya  Mumbai   NaN          NaN
103      Priya   Delhi   NaN         60.0

In [95]:
df.sort_index(axis=1)

        Age     Name  Revised_col address
102    24.0  Nimisha         24.0    Pune
rank1   NaN     Riya          NaN  Mumbai
103     NaN    Priya         60.0   Delhi